# Pandas - DataFrames
* DataFrame is The Collection of the Serises Which are share the index

In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(np.random.randint(1,25,(5,5)),['A','B','C','D','E'],['W','X','Y','Z','M'])
df

    W   X   Y   Z   M
A  12   5  10   5  12
B  19   9   8   5   5
C   6  20   4   9  20
D   5  19  19   7   6
E   3  23  19  23   9

In [6]:
df['W']

A    12
B    19
C     6
D     5
E     3
Name: W, dtype: int32

In [9]:
type(df['W'])
type(df)

pandas.core.frame.DataFrame

In [10]:
# Fetch The Data From the Multiple Column
df[['W','X','Y']]

    W   X   Y
A  12   5  10
B  19   9   8
C   6  20   4
D   5  19  19
E   3  23  19

In [23]:
# Data Fetch Using The Sql Statement : 
df.W

A    12
B    19
C     6
D     5
E     3
Name: W, dtype: int32

In [28]:
# Adding The column Form The DataFrame
df['sum'] = df['Z'] + df['M']
df['sum']
df

    W   X   Y   Z   M  sum
A  12   5  10   5  12   17
B  19   9   8   5   5   10
C   6  20   4   9  20   29
D   5  19  19   7   6   13
E   3  23  19  23   9   32

In [34]:
# Remove the Column From The DataFrame
# axis = 1 from the colum data 
# After The Perfom The Operation Data Not Permanent Delete
# df.drop('sum',axis=1)
df
# df.drop('sum',axis=1,inplace=True)

    W   X   Y   Z   M
A  12   5  10   5  12
B  19   9   8   5   5
C   6  20   4   9  20
D   5  19  19   7   6
E   3  23  19  23   9

In [35]:
df.shape

(5, 5)

In [36]:
# Remove The E Row From Teh DataSet
df.drop('E',inplace=True)

In [37]:
df

    W   X   Y  Z   M
A  12   5  10  5  12
B  19   9   8  5   5
C   6  20   4  9  20
D   5  19  19  7   6

In [39]:
# Fetch The Data From The Row
df.loc['D']

W     5
X    19
Y    19
Z     7
M     6
Name: D, dtype: int32

In [41]:
df.iloc[3]

W     5
X    19
Y    19
Z     7
M     6
Name: D, dtype: int32

In [47]:
# First Pass The ROW and Next pass The column
df.loc[['A','B'],['W','X']]

    W  X
A  12  5
B  19  9

In [48]:
df.loc['A','W']

12

In [49]:
df

    W   X   Y  Z   M
A  12   5  10  5  12
B  19   9   8  5   5
C   6  20   4  9  20
D   5  19  19  7   6